app/views/dashboard/index.html.erb

SELECT `projects`.* FROM `projects`
---
			<th bgcolor="lightblue" >Status</th>
				<% Project.all.each do |project| %>

SELECT `projects`.* FROM `projects`
SELECT `todos`.* FROM `todos` WHERE `todos`.`project_id` = 1 AND `todos`.`status` = 'done'
---
			<td bgcolor="lightgreen">Done</td>
			<% Project.all.each do |project| %>
				<% if project.todos.where(status: 'done').nil? %>

SELECT `todos`.* FROM `todos` WHERE `todos`.`project_id` = 1 AND `todos`.`status` = 'done'
---
					<td>
						<% project.todos.where(status: 'done').each do |task| %>

SELECT `projects`.* FROM `projects`
SELECT `todos`.* FROM `todos` WHERE `todos`.`project_id` = 1 AND `todos`.`status` = 'new'
---
			<td bgcolor="red">In-progress</td>
			<% Project.all.each do |project| %>
				<% if project.todos.where(status: 'in-progress').nil? %>

SELECT `todos`.* FROM `todos` WHERE `todos`.`project_id` = 1 AND `todos`.`status` = 'new'
---
					<td>
						<% project.todos.where(status: 'in-progress').each do |task| %>

SELECT `projects`.* FROM `projects`
---
			<td bgcolor="orange">New Task</td>
			<% Project.all.each do |project| %>

SELECT `todos`.* FROM `todos` WHERE `todos`.`project_id` = 1 AND `todos`.`status` = 'new'
---
					<td>
						<% project.todos.where(status: 'new').each do |task| %>