app/views/projects/_form.html.erb

SELECT `users`.* FROM `users`
---
    <p>Assign developer</p>
     <!-- <%= collection_check_boxes(:project, :users, User.all, :id, :name) %>  -->

<%= f.collection_check_boxes :user_ids, User.all, :id, :name, include_hidden: false  %>