app/views/projects/index.html.erb

			<td>
				<% project.users.each do |developer| %>
---
SELECT `users`.* FROM `users` INNER JOIN `projects_users` ON `users`.`id` = `projects_users`.`user_id` WHERE `projects_users`.`project_id` = 1