app/views/todos/_form.html.erb

SELECT `projects`.* FROM `projects`
SELECT `users`.* FROM `users`
---
    <p>Assign Project </p>
    <%= f.collection_select :project_id, Project.all, :id, :name %>
    <p>Assign developer</p>
<%= f.collection_select :user_id, User.all, :id, :name %>