app/controllers/projects_controller.rb

	def create
		@project = Project.new(project_params)

		if @project.save!
---
INSERT INTO `projects` (`name`, `created_at`, `updated_at`) VALUES ('Nuance', '2018-05-30 10:37:24', '2018-05-30 10:37:24')

	def show
    	@project = Project.find(params[:id])
    	@todos_graph = @project.todos.group(:status).count.to_a
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 8 LIMIT 1
SELECT COUNT(*) AS count_all, `todos`.`status` AS todos_status FROM `todos` WHERE `todos`.`project_id` = 1 GROUP BY `todos`.`status`

    def update
	    @project = Project.find(params[:id])
	    if @project.update_attributes(project_params)
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 8 LIMIT 1
UPDATE `projects` SET `name` = 'Projectsix', `updated_at` = '2018-05-30 16:55:50' WHERE `projects`.`id` = 7