app/controllers/todos_controller.rb

	def index
		if current_user.user_role.eql?('admin')
		  @todos = Todo.all
---
SELECT `todos`.* FROM `todos`

	def create
		@todo = Todo.new(todo_params)
	    if @todo.save
---
INSERT INTO `todos` (`name`, `description`, `user_id`, `created_at`, `updated_at`, `project_id`) VALUES ('task8', 'to create release notes', 7, '2018-05-31 07:52:03', '2018-05-31 07:52:03', 1)

	def edit
    @todo = Todo.find(params[:id])
---
SELECT  `todos`.* FROM `todos` WHERE `todos`.`id` = 5 LIMIT 1

  def show
    @todo= Todo.find(params[:id])
---
SELECT  `todos`.* FROM `todos` WHERE `todos`.`id` = 1 LIMIT 1

  def update
	  @todo = Todo.find(params[:id])
	  if @todo.update_attributes(todo_params)
---
SELECT  `todos`.* FROM `todos` WHERE `todos`.`id` = 3 LIMIT 1
UPDATE `todos` SET `status` = 'done', `updated_at` = '2018-05-31 08:06:13' WHERE `todos`.`id` = 3