app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)

		if @user.save
---
INSERT INTO `users` (`name`, `role_id`, `created_at`, `updated_at`, `email`, `encrypted_password`) VALUES ('Developer1', 1, '2018-05-30 13:37:28', '2018-05-30 13:37:28', 'developer1@gmail.com', '$2a$11$srle8ilc3Rt9XLOajm.nCOvbv4.exx5nZENW5g1VB3J0a7WLmAeTS')

    def update
	    @user = User.find(params[:id])
	    if @user.update_attributes(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `role_id` = 1, `encrypted_password` = '$2a$11$kuFtBU1m1TBao/ORIa4meu4btlMuX9vQvUTbX9qG46iHgw73ea9q.', `updated_at` = '2018-05-30 17:05:12' WHERE `users`.`id` = 3